Tekla Open API Reference for Tekla Structures 2025
WeldMark.SeamVisibilityAttributes Constructor
 Creates a new weld seam visibility attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SeamVisibilityAttributes()
Public Sub New
See Also
Reference
WeldMark.SeamVisibilityAttributes Class
WeldMark.SeamVisibilityAttributes Overload
Tekla.Structures.Drawing Namespace